[
  {
    "category": "Weapon Rules",
    "rules": [
      {
        "name": "Accurate x",
        "description": "You can retain up to x attack dice as normal successes without rolling them. If a weapon has multiple instances, treat it as Accurate 2."
      },
      {
        "name": "Balanced",
        "description": "You can re-roll one of your attack dice."
      },
      {
        "name": "Blast x",
        "description": "After shooting the primary target, shoot against each secondary target visible to and within x of the primary target (e.g., Blast 2\"). Secondary targets are valid regardless of a Conceal order."
      },
      {
        "name": "Brutal",
        "description": "Your opponent can only block with critical successes."
      },
      {
        "name": "Ceaseless",
        "description": "You can re-roll any of your attack dice results of one specific result (e.g., all results of 2)."
      },
      {
        "name": "Devastating x",
        "description": "Each retained critical success immediately inflicts x damage on the operative. If the rule includes a distance (e.g., 1\" Devastating x), inflict that damage on the target and every other operative visible within that distance."
      },
      {
        "name": "Heavy",
        "description": "An operative cannot move in the same activation or counteraction it uses this weapon, and vice versa. If specified as 'Heavy (x only)', only that specific move action is allowed."
      },
      {
        "name": "Hot",
        "description": "After using this weapon, roll one D6: if the result is lower than the weapon's Hit stat, the operative takes damage equal to the result multiplied by two."
      },
      {
        "name": "Lethal x+",
        "description": "Attack dice results equal to or greater than x are critical successes (e.g., Lethal 5+)."
      },
      {
        "name": "Limited x",
        "description": "The weapon can only be used a number of times equal to x during the battle."
      },
      {
        "name": "Piercing x",
        "description": "The defender rolls x fewer defence dice. 'Piercing Crits x' only applies if you retain critical successes."
      },
      {
        "name": "Punishing",
        "description": "If you retain any critical successes, you can retain one failed die as a normal success instead of discarding it."
      },
      {
        "name": "Range x",
        "description": "Only operatives within distance x of the active operative can be valid targets."
      },
      {
        "name": "Relentless",
        "description": "You can re-roll any of your attack dice."
      },
      {
        "name": "Rending",
        "description": "If you retain any critical successes, you can change one retained normal success into a critical success."
      },
      {
        "name": "Saturate",
        "description": "The defender cannot retain cover saves against this weapon."
      },
      {
        "name": "Seek",
        "description": "When selecting targets, operatives with a Conceal order cannot use terrain for cover. 'Seek Light' only ignores Light terrain for cover."
      },
      {
        "name": "Severe",
        "description": "If you do not retain any critical successes, you can change one normal success into a critical success."
      },
      {
        "name": "Shock",
        "description": "The first time you strike with a critical success in a sequence, discard one of the opponent's unresolved normal successes (or a critical if no normal successes remain)."
      },
      {
        "name": "Silent",
        "description": "The operative can perform a Shoot action with this weapon even while it has a Conceal order."
      },
      {
        "name": "Stun",
        "description": "If you retain any critical successes, subtract 1 from the target operative's APL stat until the end of its next activation."
      },
      {
        "name": "Torrent x",
        "description": "Select a primary target, then shoot against any number of other valid targets within distance x of that target (but not within control range of your friendly operatives)."
      },
      {
        "name": "Poison",
        "description": "On a successful hit, inflicts a Poison token."
      },
      {
        "name": "Toxic",
        "description": "If target has a Poison token, add 1 to both Normal and Critical damage stats."
      }
    ]
  }
]